In [2]:
dict={'a':'one','b':'two','c':3}

In [3]:
print(dict['a'])

one

# Converting Dictionary to Series

### Importing Series and Pandas

In [4]:
from pandas import Series

In [5]:
ser = Series(dict)

print(ser)

In [7]:
ser['a']

'one'

# Practice

##### Create dictionary of 5 elements and convert it into series and print the 4th value

In [8]:
dictP = {'a':'one','b':'two','c':'three','d':'four','e':'five'}

In [9]:
dictP

{'a': 'one', 'b': 'two', 'c': 'three', 'd': 'four', 'e': 'five'}

In [10]:
cvse = Series(dictP)

In [11]:
cvse

a      one
b      two
c    three
d     four
e     five
dtype: object

In [12]:
cvse['d']

'four'

# Converting dictionary to dataframe

# Data Frame

### Importing DataFrame

In [13]:
from pandas import DataFrame

In [14]:
dictDf = {'name':['ay','mn','as'],
         'age':['21','22','21'],
         'sal':['10000','12000','20000']}

In [15]:
dictDf

{'name': ['ay', 'mn', 'as'],
 'age': ['21', '22', '21'],
 'sal': ['10000', '12000', '20000']}

In [16]:
cvDf = DataFrame(dictDf)

In [17]:
cvDf

  name age    sal
0   ay  21  10000
1   mn  22  12000
2   as  21  20000

# Rearranging columns

### Syntax
####  DataFrame(var,columns=["order of keys"])

In [19]:
ordF = DataFrame(dictDf,columns=['age','sal','name'])

In [20]:
ordF

  age    sal name
0  21  10000   ay
1  22  12000   mn
2  21  20000   as

### Adding new column

In [21]:
addCol = DataFrame(dictDf,columns=['age','sal','name','ph.no'])

In [22]:
addCol

  age    sal name ph.no
0  21  10000   ay   NaN
1  22  12000   mn   NaN
2  21  20000   as   NaN

### Accessing a particular column

In [23]:
addCol['name']

0    ay
1    mn
2    as
Name: name, dtype: object

### ix - get row of x direction

In [25]:
#addCol.ix[2]

### iloc - get specific row

In [26]:
addCol.iloc[2]

age         21
sal      20000
name        as
ph.no      NaN
Name: 2, dtype: object

### Transpose

In [27]:
addCol = addCol.T

In [28]:
addCol

           0      1      2
age       21     22     21
sal    10000  12000  20000
name      ay     mn     as
ph.no    NaN    NaN    NaN

#### revert

In [29]:
addCol = addCol.T

In [30]:
addCol

  age    sal name ph.no
0  21  10000   ay   NaN
1  22  12000   mn   NaN
2  21  20000   as   NaN